test_cases/kOmega-SST_3D/steadyState/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (20 0 0); 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (20 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    Jet 
    {
        type            noSlip;
    }

    wallPreInlet
    {
        type            slip;
    }

    upperWall
    {
        type            noSlip;
    }

    lowerWall
    {
        type            noSlip;
    }

    "(front|back)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
